//====================================================================
//  工学部「情報環境実験２」(富永)  C言語プログラミング  例題
//  ポーカーゲームの戦略
//--------------------------------------------------------------------
//  Poker  usr/s13t200_02/  PokerOpe.c
//  Linux CentOS 6.7  GCC 4.4.7
//--------------------------------------------------------------------
//  林研究室  s15t241 土居高輔
//  2017.12.05
//====================================================================


//====================================================================
//  仕様
//====================================================================

/*--------------------------------------------------------------------

手札、場札、チェンジ数、テイク数、捨札を引数とし、捨札を決める。
返却値は、捨札の位置である。-1のときは、交換しないで、手札を確定させる。
関数 strategy() は、戦略のインタフェースであり、この関数内で、
実際の戦略となる関数を呼び出す。手札と捨札は、不正防止のため、
変更不可なので、局所配列にコピーして、整列などの処理を行う。
複数の戦略を比較したり、パラメタを変化させて、より強い戦略を目指す。

---------------------------------------------------------------------*/


//====================================================================
//  前処理
//====================================================================

#include <stdio.h>
#include <stdlib.h>
#include <math.h>

#include "Poker.h"

#define HNUM 5
//--------------------------------------------------------------------
//  関数宣言
//--------------------------------------------------------------------

int judgement(int hd[]);
int flash(int hd[]);
//int ScoreAttack(int flag[]);


//====================================================================
//  戦略
//====================================================================

/*--------------------------------------------------------------------
//  ユーザ指定
//--------------------------------------------------------------------

hd : 手札配列
fd : 場札配列(テイク内の捨札)
cg : チェンジ数
tk : テイク数
ud : 捨札配列(過去のテイクも含めた全ての捨札)
us : 捨札数

--------------------------------------------------------------------*/

int strategy(int hd[], int fd[], int cg, int tk, int ud[], int us)
{
  int myhd[HNUM];
  int k;
  int fa;

  for ( k = 0; k < HNUM; k++) { myhd[k] = hd[k]; } // 手札をmyhd[]に格納

  fa = judgement(hd[]);                            // 手札の判断

  return fa;
}


//====================================================================
//  補助関数
//====================================================================


/* どの役が出来ているか判断し、どのカードを捨てるか、または勝負するかを決定します */
 int judgement(int hd[]) {
   int flag;

   //-- フラッシュ
   flag = flash();

   if ( flag == 5 ) {
     return -1;
   } else if ( flag = 6 ) {
   } else {
     return flag;
   }

   return 0;
 }


/* フラッシュの役が出来ているか判断します。 */
 int flash(int hd[]){
   int flag = 0;                           // 役ができているか.2は5枚揃い.1は4枚揃い
   int tmp;
   int kind[5];
   int num[4] = {0, 0, 0, 0};
   int k, k1, k2;

   //-- カードの属性を格納
   for ( k = 0; k < 5; k++ ) {
     tmp = hd[k] / 13;
     kind[k] = tmp;
   }

   //-- 5枚揃っているか
   for ( k1 = 0 ; k1 < 4; k1++ ) {
     for ( k2 = 0; k2 < 5; k2++ ) {
       if ( kind[k2] == k1 ) {
         flag = 2;
       } else {
         flag = 0;
       }
     }
   }

   if ( flag == 2 ) {
     return 5;                              // 5枚揃っていたら終了.5を返す
   }

   //-- どの属性が何枚あるか
   for ( k1 = 0; k1 < 5; k1++ ) {
     for ( k2 = 0; k2 < 4; k2++ ) {
       if ( kind[k1] == k2 ) {
         num[k2]++;
       }
     }
   }

   //-- 4枚あるかどうか
   for ( k1 = 0; k1 < 4; k1++ ) {
     if ( num[k1] == 4 ) {
       for ( k2 = 0; k2 < 5; k2++ ) {
         if ( kind[k2] != k1 ) {
           return k2;                        // 交換する箇所を返す
         }
       }
     }
   }

   //-- 3カインズ以下
   return 6;
 }
